export default class Skill {
  constructor() {
    this.name = ''
    this.condition = -1
    this.type = -1
    this.value = []
    this.card = -1
    this.effect = [
    ]
  }
}

export const skillCondition = {
  '未定义': -1,
  '无／灵基突破': 0,
  '技能本': 1,
  '强化本': 2,
}
export const target = {
'00': '自己',
'01': '我方指定一人',
'02': '我方全部',
'03': '我方全部（含候补）',
'04': '我方自己除外',
'05': '我方自己除外（含候补）',
'11': '敌方指定一人',
'12': '敌方全部',
//'01001 - 01999':'我方持有某特性指定从者 - 见特性列表',
//'02001 - 02999':'我方持有某特性全部从者 - 见特性列表',
//'04001 - 04999':'我方持有某特性的全部从者（自己除外）',
//'05001 - 05999':'我方持有某特性的全部从者（自己除外，含候补）',
//'11001 - 11999':'敌方持有某特性的指定从者 - 见特性列表',
//'12001 - 12999':'敌方持有某特性的全部从者 - 见特性列表',
}

export const place = {
 '00':'全部',
 '01':'阳光直射',
 '02':'水边',
 '03':'森林',
}

export const buffOrDebuff = {
  '0': 'Buff (百分比)',
  '1': 'Buff (固定值)',
  '2': 'Debuff (百分比)',
  '3': 'Debuff (固定值)',
}

export const detail = {
  '0000': '对魔力',
  '0001': '弱体耐性',
  '0002': '攻击弱体',
  '0003': '防御弱体',
  '0004': '精神弱体',
  '0005': '魅惑耐性',
  '0006': '毒耐性',
  '0007': '毒',
  '0008': '诅咒',
  '0009': '灼烧',
  '0010': '石化',
  '0011': '行动不能',
  '0012': '眩晕',
  '0013': '拘束',
  '0014': '恐怖',
  '0015': '技能封印',
  '0016': '宝具封印',
  '0017': '出星率',
  '0018': '强化无效',
  '0019': '混乱状态',
  '0020': '强化成功率',
  '0021': '弱体成功率',
  '0022': '精神异常弱体赋予成功率',
  '0023': '眩晕赋予成功率',
  '0024': '从女性魅惑耐性',
  '1000': '攻击力',
  '1001': '红卡性能',
  '1002': '蓝卡性能',
  '1003': '绿卡性能',
  '1004': '暴击威力',
  '1005': '宝具威力',
  '2000': '防御力',
  '3000': '魅惑',
  '4000': 'NP 量',
  '4001': 'NP 获取量',
  '4002': 'NP 获得状态',
  '4003': '收到伤害时获得 NP 量',
  '4004': '目标集中',
  '4005': '星星数量',
  '4006': '星星获得状态',
  '4007': '星星集中',
  '4008': 'HP 量',
  '4009': 'HP 回复效果',
  '4010': '最大 HP',
  '4011': 'HP 获得状态',
  '4012': '即死',
  '4013': '即死耐性',
  '4014': '即死成功率',
  '4015': '加倍返还该回合所受伤害',
  '5000': '无敌',
  '5001': '闪避',
  '5002': '毅力（胆识／根性／战续）',
  '5003': '必中',
  '5004': '无敌贯通',
  '5005': '无视防御力',
  '5006': '待机状态',
  '5007': '弱体无效',
  '5008': '弱体解除',
  '5009': '强化解除',
  '5010': '精神异常解除',
  '5011': '回避状态解除',
  '5012': 'Hit 数',
  '5013': 'Hit 威力',
  '5014': '赋予攻击即死效果',
  '5015': '赋予根据自身 HP 减少程度提升暴击威力的状态',
  '5016': '技能 CD',
  '5017': '宝具蓄力阶段',
  '5018': 'HP 回复满',
  '7': '特攻',
  '8': '特防',
  '9': '特性赋予',
}

export const traitList = {
  '000': '-',
  '001': 'Saber 职介',
  '002': 'Archer 职介',
  '003': 'Lancer 职介',
  '004': 'Rider 职介',
  '005': 'Caster 职介',
  '006': 'Assassin 职介',
  '007': 'Berserker 职介',
  '008': 'Ruler 职介',
  '009': 'Avenger 职介',
  '010': '从者',
  '011': '男性',
  '012': '女性',
  '013': '秩序',
  '014': '混沌',
  '015': '中立',
  '016': '善',
  '017': '恶',
  '018': '中庸',
  '019': '人类',
  '020': '死灵',
  '021': '恶魔',
  '022': '神性',
  '023': '人型',
  '024': '龙',
  '025': '罗马',
  '026': '猛兽',
  '027': 'saber 脸',
  '028': '持有天/地之力的从者, 特斯拉特攻',
  '029': '持有天/地之力的从者（拟似从者、半从者除外）, 被神秘殺し所',
  '030': '持有天/地之力的从者（持有特殊星之力除外）, 闪闪特攻',
  '031': '骑乘',
  '032': '亚瑟',
  '033': '布姐所爱之人',
  '034': '魔性',
  '035': '王',
  '036': '希腊神话系男性',
  '037': '毒',
  '038': '超巨大',
  '300': '神性、恶魔、死灵',
  '301': '死灵、恶魔',
  '302': '异性',
}

export const skillDuration = {
  '一次性': 0,
  '一回合': 1,
  '两回合': 2,
  '三回合': 3,
  '四回合': 4,
  '五回合': 5,
  '永续': 99999,
}

export const skillEffectiveTime = {
  '死亡后': -2,
  '当即生效': -1,
  '回合结束': 0,
  '一回合后': 1,
}

export const npEffectType = {
  '固定值': 0,
  '宝具升级效果提升': 1,
  '超蓄力效果提升': 2,
}

export const npCondition = {
  '未定义': -1,
  '无': 0,
  '宝具本': 1,
  '强化本': 2,
}

export const npType = {
  '非攻击（辅助类）': 0,
  '全体攻击': 1,
  '单体攻击': 2,
  '变身海德': 3,
}

export const npCardType = {
  '蓝卡': 0,
  '红卡': 1,
  '绿卡': 2,
}
